/*
 * このファイルは tecsgen により自動生成されました
 * このファイルを編集して使用することは、意図されていません
 */
#include "tA_tecsgen.h"
#include "tA_factory.h"


/* 変数(構造体、配列)初期値 #_AVI_# */
const struct A	tA_v2_VAR_INIT = { -128, 32767, };
const struct A	tA_v3_VAR_INIT = { 127, 32768, };
const int32_t	tA_v4_VAR_INIT[2] = { 1, 2, };

/* 呼び口の参照する受け口ディスクリプタ(実際の型と相違した定義) #_CPEPD_# */


/* 呼び口配列 #_CPA_# */


/* 属性・変数の配列 #_AVAI_# */
/* セル INIB #_INIB_# */
tA_INIB tA_INIB_tab[] = {
    /* cell: tA_CB_tab[0]:  a id=1 */
    {
        /* attribute(RO) */ 
        {                                        /* a1 */
            127,                                     /* a */
            0,                                       /* b */
            {
                105,                                     /* c[0] */
                106,                                     /* c[1] */
            },
        },
        {                                        /* a2 */
            -128,                                    /* a */
            32767,                                   /* b */
            {
                100,                                     /* c[0] */
                9101,                                    /* c[1] */
            },
        },
        {                                        /* a3 */
            {                                        /* a */
                0,                                       /* a */
                1,                                       /* b */
                {
                    -2,                                      /* c[0] */
                    -5,                                      /* c[1] */
                },
            },
            -9,                                      /* b */
        },
        {
            1,                                       /* a4[0] */
            2,                                       /* a4[1] */
        },
        10,                                      /* a5 */
    },
    /* cell: tA_CB_tab[1]:  b id=2 */
    {
        /* attribute(RO) */ 
        {                                        /* a1 */
            127,                                     /* a */
            32767,                                   /* b */
            {
                1,                                       /* c[0] */
                2,                                       /* c[1] */
            },
        },
        {                                        /* a2 */
            -128,                                    /* a */
            32767,                                   /* b */
            {
                3,                                       /* c[0] */
                4,                                       /* c[1] */
            },
        },
        {                                        /* a3 */
            {                                        /* a */
                127,                                     /* a */
                0,                                       /* b */
                {
                    16,                                      /* c[0] */
                    17,                                      /* c[1] */
                },
            },
            100,                                     /* b */
        },
        {
            1,                                       /* a4[0] */
            2,                                       /* a4[1] */
        },
        10,                                      /* a5 */
    },
};

/* セル CB #_CB_# */
struct tag_tA_CB tA_CB_tab[] = {
    /* cell: tA_CB_tab[0]:  a id=1 */
    {
        &tA_INIB_tab[0],                         /* _inib */
        /* var */ 
        10,                                      /* v1 */
        {                                        /* v2 */
            -128,                                    /* a */
            32767,                                   /* b */
        },
        {                                        /* v3 */
            127,                                     /* a */
            32768,                                   /* b */
        },
        {
            1,                                       /* v4[0] */
            2,                                       /* v4[1] */
        },
    },
    /* cell: tA_CB_tab[1]:  b id=2 */
    {
        &tA_INIB_tab[1],                         /* _inib */
        /* var */ 
        10,                                      /* v1 */
        {                                        /* v2 */
            -128,                                    /* a */
            32767,                                   /* b */
        },
        {                                        /* v3 */
            127,                                     /* a */
            32768,                                   /* b */
        },
        {
            1,                                       /* v4[0] */
            2,                                       /* v4[1] */
        },
    },
};

/* 受け口ディスクリプタ #_EPD_# */
